Public Attributes | List of all members
ACAPI::MEP::DuctBranchPreferenceTable::Key Struct Reference
MEP Element Manager
The key that uniquely identifies a row in the DuctBranchPreferenceTable. More...
#include <MEPDuctBranchPreferenceTable.hpp>
 Public Attributes
 uint32_t  | mainAxisReferenceId
The main axis referenceId of the row. The table only contains the referenceIds that are defined in the DuctReferenceSet.
 double  | branchAxisAngle
The branch axis angle of the row. The table only contains the angles that are defined in the DuctAngleSet. Needs to be between [1, 90] degrees.
 uint32_t  | branchAxisReferenceId
The branch axis referenceId of the row. The table only contains the referenceIds that are defined in the DuctReferenceSet.
Detailed Description
The key that uniquely identifies a row in the DuctBranchPreferenceTable.
Since
Archicad 29